install_everything.org
#+title: Install Everything
#+autotangle: t

* Introduction
This script will install everything for my ubuntu wsl setup
* Bash headers
#+name bash_header
#+begin_src bash :tangle yes
#!/bin/bash
set -e
set -x
#+end_src
* Basic programs

#+begin_src bash :tangle yes :comments both
[ -d "$HOME/tmp" ] || mkdir "$HOME/tmp"
[ -d "$HOME/.local/bin" ] || mkdir -p "$HOME/.local/bin"
[ -d "$HOME/.status" ] || mkdir -p "$HOME/.status"
#+end_src

#+begin_src bash :tangle yes
sudo apt install -y  \
    autoconf \
    automake \
    cscope \
    curl \
    emacs \
    ffmpeg \
    ffmpegthumbnailer \
    firefox \
    git \
    gnome-software \
    gnuplot \
    htop \
    imagemagick \
    kdialog \
    kdiff3 \
    libssl-dev \
    mediainfo \
    mlocate \
    mpv \
    neofetch \
    newsboat \
    npm \
    obs-studio \
    octave \
    pandoc \
    pkg-config \
    python3 \
    python3-pip \
    qrencode \
    ranger \
    ripgrep \
    rsync \
    ruby \
    shellcheck \
    stow \
    tldr \
    urlview \
    vim \
    vim-gtk \
    x11-xserver-utils \
    yank \
#+end_src

* Install doom emacs
#+begin_src bash :tangle yes
stow -R doom_emacs -t "$HOME" --no-folding
git clone --depth 1 https://github.com/doomemacs/doomemacs ~/.emacs.d
~/.emacs.d/bin/doom install
~/.emacs.d/bin/doom sync
#+end_src

* Install fzf
#+begin_src bash :tangle yes
git clone --depth 1 "git@github.com:junegunn/fzf.git" ./stow_vim_plugins/.fzf
stow -R stow_vim_plugins -t "$HOME"
"$HOME/.fzf/install" --all
#+end_src
